In [1]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

   PassengerId  ... Survived
0            1  ...        0
1            2  ...        1
2            3  ...        1
3            4  ...        1
4            5  ...        0

[5 rows x 12 columns]

# Data exploration

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns', inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [3]:
target = df.Survived
inputs = df.drop('Survived', axis='columns')

## Text to Number

In [5]:
dummies = pd.get_dummies(inputs.Sex).astype('int')
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
inputs = pd.concat([inputs,dummies], axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
inputs.drop('Sex', axis='columns', inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

## Checking null columns

In [9]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [12]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

## Filling null columns

In [14]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(10)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1
7       3   2.000000  21.0750       0     1
8       3  27.000000  11.1333       1     0
9       2  14.000000  30.0708       1     0

# Train, Test, Split

In [20]:
from sklearn.model_selection import train_test_split
X_train, X_test, Y_train, Y_test = train_test_split(inputs, target, test_size=0.2)

# Naive Base Model
### Using Gaussian Naive Base

In [21]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [22]:
model.fit(X_train, Y_train)

GaussianNB()

In [23]:
model.score(X_test, Y_test)

0.776536312849162

In [24]:
X_test[:10]

     Pclass        Age     Fare  female  male
463       2  48.000000  13.0000       0     1
507       1  29.699118  26.5500       0     1
612       3  29.699118  15.5000       1     0
279       3  35.000000  20.2500       1     0
749       3  31.000000   7.7500       0     1
678       3  43.000000  46.9000       1     0
237       2   8.000000  26.2500       1     0
54        1  65.000000  61.9792       0     1
61        1  38.000000  80.0000       1     0
42        3  29.699118   7.8958       0     1

In [25]:
Y_test[:10]

463    0
507    1
612    1
279    1
749    0
678    0
237    1
54     0
61     1
42     0
Name: Survived, dtype: int64

In [26]:
model.predict(X_test[:10])

array([0, 0, 1, 1, 0, 1, 1, 0, 1, 0], dtype=int64)

In [27]:
model.predict_proba(X_test[:10])

array([[9.81089082e-01, 1.89109185e-02],
       [9.21080137e-01, 7.89198629e-02],
       [6.89711732e-02, 9.31028827e-01],
       [7.04775610e-02, 9.29522439e-01],
       [9.91528852e-01, 8.47114753e-03],
       [4.24941101e-02, 9.57505890e-01],
       [1.92964479e-02, 9.80703552e-01],
       [7.34680121e-01, 2.65319879e-01],
       [7.79270562e-04, 9.99220729e-01],
       [9.91447832e-01, 8.55216840e-03]])